In [5]:

df = list("Name" = c("John", "Jake"), "Treatment A" = c(10, 12), "Treatment B" = c(20, 21))

df = data.frame(df)

df

  Name Treatment.A Treatment.B
1 John 10          20
2 Jake 12          21

We reshape the dataset so that the variable treatment (of value A, B) is in a single column

In [9]:
library(reshape2)

melt(df, id.vars = 'Name', variable.name = 'Treatment', value.name = 'Result')

  Name Treatment   Result
1 John Treatment.A 10
2 Jake Treatment.A 12
3 John Treatment.B 20
4 Jake Treatment.B 21

In [41]:
df = list("Name" = c('John', 'Jake', 'Anna', 'Spongebob'), "Class"= c('Economy', 'First', 'First', 'Business'))


df = data.frame(df)

df

  Name      Class
1 John      Economy
2 Jake      First
3 Anna      First
4 Spongebob Business

In [42]:
# identifies all distinct types of class
all_class_type = c()

for (class_type in df$Class) {
    if (is.na(match(class_type, all_class_type))) {
        all_class_type = c(all_class_type, class_type)
    }
}

all_class_type

[1] "Economy"  "First"    "Business"

In [43]:
for (class_type in all_class_type) {
    class_type_col = c()
    for (class in df$Class) {
        if (grepl(class_type, class)) {
            class_type_col = c(class_type_col, 1)
        } else {
            class_type_col = c(class_type_col, 0)
        }
    }
    df = cbind(df, class_type_col)
    colnames(df)[length(colnames(df))] = class_type
}

In [44]:
df

  Name      Class    Economy First Business
1 John      Economy  1       0     0
2 Jake      First    0       1     0
3 Anna      First    0       1     0
4 Spongebob Business 0       0     1